app/Http/Controllers/Auth/AuthController.php

    public function showLoginForm ()
    {

        if(!User::where("email", "admin@ortn.com")->exists()) {
---
select exists(select * from `users` where `email` = 'admin@rdm.com') as `exists`