app/Http/Controllers/Front/Podcast/PodcastController.php

    public function indexAudio()
    {
        $audios = Audio::with(['media', 'categorieAudio'])->latest()->paginate(10);
---
select * from `audio` order by `created_at` desc limit 10 offset 0
select * from `categorie_audios` where `categorie_audios`.`id` in (1, 3, 4, 5, 6)
select * from `media` where `media`.`id` in (11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select count(*) as aggregate from `audio`