app/Http/Controllers/Front/Actualite/UserActualiteController.php

select `categorie_audios`.*, (select count(*) from `audio` where `categorie_audios`.`id` = `audio`.`categorie_audio_id`) as `audios_count` from `categorie_audios` order by `audios_count` desc limit 3
select `categorie_videos`.*, (select count(*) from `videos` where `categorie_videos`.`id` = `videos`.`categorie_video_id`) as `videos_count` from `categorie_videos` order by `videos_count` desc limit 5
select * from `categorie_articles` where `categorie_articles`.`id` in (2, 3, 4, 5, 6, 7)
select * from `type_articles` where `type_articles`.`id` in (11, 12, 13, 14, 15, 16, 17, 18, 20, 22)
select count(*) as aggregate from `articles`
select * from `commentaires` where `commentaires`.`article_id` in (7, 8, 9, 10, 11, 12, 13, 14, 15, 17)
select * from `media` where `media`.`id` in (33, 34, 35, 36, 37, 38, 39, 40, 41, 43)
select `categorie_articles`.*, (select count(*) from `articles` where `categorie_articles`.`id` = `articles`.`categorie_article_id`) as `articles_count` from `categorie_articles` order by `articles_count` desc
select * from `audio` order by `created_at` desc
select * from `categorie_audios` where `categorie_audios`.`id` in (1, 2, 3, 4, 5, 6)
select * from `media` where `media`.`id` in (9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select * from `categorie_videos` where `categorie_videos`.`id` in (1, 2, 3)
select * from `media` where `media`.`id` in (1, 2, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30)
select * from `videos` order by `created_at` desc
---
    public function index()
    {
        // 3 catégories audio les plus actives
        $categoriesAudio = CategorieAudio::withCount('audios')
            ->orderByDesc('audios_count')
            ->take(3)
            ->get();

        // 5 catégories vidéo les plus actives
        $categoriesVideo = CategorieVideo::withCount('videos')
            ->orderByDesc('videos_count')
            ->take(5)
            ->get();

        // catégories d'articles
        $categoriesArticle = CategorieArticle::withCount('articles')
            ->orderByDesc('articles_count')
            ->get();

        // article à la une (le plus récent)
        $featuredArticle = Article::with(['media', 'categorieArticle', 'typeArticle'])
            ->withCount('commentaires')
            ->latest()
            ->first();

        // autres articles, sans celui à la une
        $articles = Article::with(['media', 'categorieArticle', 'typeArticle', 'commentaires'])
            ->withCount("commentaires")
            ->where('id', '!=', optional($featuredArticle)->id) // exclure la une
            ->latest()
            ->paginate(10);

        // Tous les podcasts audio
        $audios = Audio::with(['media', 'categorieAudio'])
            ->latest()
            ->get();

        // Tous les podcasts vidéo
        $videos = Video::with(['media', 'categorieVideo'])
            ->latest()
            ->get();

select * from `categorie_articles` where `categorie_articles`.`id` in (4)
select * from `type_articles` where `type_articles`.`id` in (22)
---
    public function showByCategorie($slug)
    {
        // Trouver la catégorie via le slug
        $categorie = CategorieArticle::where('slug', $slug)
            ->with('articles.media', 'articles.categorieArticle', 'articles.typeArticle')
            ->firstOrFail();

select * from `commentaires` where `commentaires`.`article_id` in (12)
select * from `categorie_articles` where `categorie_articles`.`id` in (4)
select * from `type_articles` where `type_articles`.`id` in (16)
select * from `media` where `media`.`id` in (8, 37, 43)
select `categorie_articles`.*, (select count(*) from `articles` where `categorie_articles`.`id` = `articles`.`categorie_article_id`) as `articles_count` from `categorie_articles` order by `articles_count` desc
update `articles` set `views` = `views` + 1, `articles`.`updated_at` = '2025-10-27 10:45:22' where `id` = 12
---
    public function render(string $slug)
    {
        // Récupérer l'article principal via le slug du média
        $article = Article::whereHas('media', function ($query) use ($slug) {
            $query->where('slug', $slug);
        })->with(['media', 'categorieArticle', 'typeArticle', 'commentaires.user'])->withCount("commentaires")->firstOrFail();

        // catégories d'articles
        $categoriesArticle = CategorieArticle::withCount('articles')
            ->orderByDesc('articles_count')
            ->get();

        // Récupérer les articles similaires (même catégorie ou même type)
        $articlesSimilaires = Article::where('id', '!=', $article->id)
            ->where(function ($query) use ($article) {
                $query->where('categorie_article_id', $article->categorie_article_id)
                    ->orWhere('type_article_id', $article->type_article_id);
            })
            ->with(['media', 'categorieArticle', 'typeArticle'])
            ->latest()
            ->take(4)
            ->get();

        // Incrémente le nombre de vues
        $article->increment('views');