app/Http/Controllers/Front/Newsletter/NewsletterController.php

    public function store (UserNewsletterRequest $request)
    {
        // dd($request->validated());

        $data = $request->validated();

        NewsLetterAbonne::firstOrCreate(
            ['email' => $data['email']],
            [
                'date_abonnement' => now(),
                'actif' => true
            ]
        );
---
insert into `news_letter_abonnes` (`email`, `date_abonnement`, `actif`, `updated_at`, `created_at`) values ('admin@rdm.com', '2025-10-27 11:12:15', 1, '2025-10-27 11:12:15', '2025-10-27 11:12:15')
select * from `news_letter_abonnes` where (`email` = 'admin@rdm.com') limit 1