app/Http/Controllers/Front/User/HomeController.php

    public function index ()
    {

        // catégories d'articles
        $categoriesArticle = CategorieArticle::withCount('articles')
            ->orderByDesc('articles_count')
            ->get();

        // articles
        $articles = Article::with(["media","categorieArticle", "typeArticle"])
            ->withCount("commentaires")
            ->latest()
            ->take(6)
            ->get();

        // 5 catégories vidéo avec nombre de vidéos
        $categoriesVideo = CategorieVideo::withCount('videos')
            ->orderByDesc('videos_count')
            ->take(5)
            ->get();

        // Tous les podcasts vidéo
        $videos = Video::with(['media', 'categorieVideo'])
            ->latest()
            ->take(5)
            ->get();

        // 5 catégories audio avec nombre d'audios
        $categoriesAudio = CategorieAudio::withCount('audios')
            ->orderByDesc('audios_count')
            ->take(3)
            ->get();

        // Tous les podcasts audio
        $audios = Audio::with(['media', 'categorieAudio'])
            ->latest()
            ->take(6)
            ->get();
---
select * from `categorie_articles` where `categorie_articles`.`id` in (4, 5, 6, 7)
select `categorie_articles`.*, (select count(*) from `articles` where `categorie_articles`.`id` = `articles`.`categorie_article_id`) as `articles_count` from `categorie_articles` order by `articles_count` desc
select count(*) as aggregate from `articles`
select * from `media` where `media`.`id` in (38, 39, 40, 41, 43)
select * from `type_articles` where `type_articles`.`id` in (16, 17, 18, 20, 22)
select * from `categorie_videos` where `categorie_videos`.`id` in (1, 2, 3)
select `categorie_videos`.*, (select count(*) from `videos` where `categorie_videos`.`id` = `videos`.`categorie_video_id`) as `videos_count` from `categorie_videos` order by `videos_count` desc limit 5
select * from `media` where `media`.`id` in (26, 27, 28, 29, 30)
select * from `videos` order by `created_at` desc limit 5
select `categorie_audios`.*, (select count(*) from `audio` where `categorie_audios`.`id` = `audio`.`categorie_audio_id`) as `audios_count` from `categorie_audios` order by `audios_count` desc limit 3
select * from `audio` order by `created_at` desc
select * from `categorie_audios` where `categorie_audios`.`id` in (1, 2, 3, 4, 5, 6)
select * from `media` where `media`.`id` in (9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)