app/Http/Controllers/Front/Programme/ProgrammeController.php

    public function getData()
    {
        $jourActuel = strtolower(Carbon::now()->locale('fr')->dayName);
        $heureActuelle = Carbon::now()->format('H:i:s');

        $programmes = Programme::latest()->get()->map(function ($programme) {
            $programme->jour_diffusion = json_decode($programme->jour_diffusion, true);
            return $programme;
        });
---
select * from `programmes` order by `created_at` desc